Catalogs/ПриоритетыСтатус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПриоритетыСтатус</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БольшаяКартинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоЗадач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗадачУИсполнителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МалаяКартинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КоличествоЗадач</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипКонтроляПриоритета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтроляПриоритета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗадачУИсполнителя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЗадач</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омПриоритетПовтор/Ext/Module.bsl
Функция ПолучитьКартинкуПриоритетаБольшая(Приоритет) Экспорт

	Запрос = Новый Запрос;
	
	Запрос = ПолучитьЗапрос(, Ложь);
	
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Картинка;	
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции 

Функция ПолучитьЗапрос(БольшаяКартинка = Истина, МалаяКартинка = Истина)

	ЗапросТекст = 
		"ВЫБРАТЬ
		|	ПриоритетыСтатус.БольшаяКартинка КАК Картинка
		|ИЗ
		|	Справочник.ПриоритетыСтатус КАК ПриоритетыСтатус
		|ГДЕ
		|	ПриоритетыСтатус.Ссылка = &ПриоритетыСтатус";
	
	Если БольшаяКартинка И НЕ МалаяКартинка Тогда
	
		Возврат ЗапросТекст;	
	
	ИначеЕсли БольшаяКартинка И НЕ МалаяКартинка Тогда
	
		Возврат СтрЗаменить(ЗапросТекст, 
		"ПриоритетыСтатус.БольшаяКартинка КАК Картинка", "ПриоритетыСтатус.БольшаяКартинка КАК БольшаяКартинка,	ПриоритетыСтатус.МалаяКартинка КАК МалаяКартинка");
	
	Иначе
	
		Возврат СтрЗаменить(ЗапросТекст, 
		"БольшаяКартинка", "МалаяКартинка");
	
	КонецЕсли;

КонецФункции // ПолучитьЗапрос()
